//*************************************************************************
//			カード[CCard.h]
//
//			Toshiki Kuwazoe
//			2017/8/20
//
//*************************************************************************

//**************************************************************************
//			インクルードファイル
//**************************************************************************
#include "CCard.h"

//**************************************************************************
//			カード見る関数
//**************************************************************************
void CCard::Look_Card()
{
	m_nCunt = 0;

	// カード表示
	for (int i = 0; i < CARD_MAX; i++)
	{
		printf("カードの種類：%s\n", Card[i]);
		m_nCunt++;
	}

	printf("デッキ枚数：%d\n", m_nCunt);
}


//**************************************************************************
//			カードシャッフル
//**************************************************************************
void CCard::CardShuffle( char **MainDeck )
{
	// Cardの中身を消しちゃダメ！一時的にカードをデッキにコピー！
	for( int i = 0; i < CARD_MAX; i++ )
	{
		strcpy(Deck[i], Card[i]);
	}

	// 疑似乱数初期化
	srand((unsigned)time(NULL));

	for (int i = 0; i < CARD_MAX; i++)
	{
		int Card_Number;
		do
		{
			Card_Number =  rand() % CARD_MAX;
		} while (Deck[Card_Number][0] == '\0');

		// デッキにカードを設置！
		strcpy(MainDeck[i], Deck[Card_Number]);

		// Deckなら消せる！わかりやすく消しちゃう！
		Deck[Card_Number][0] = '\0';
	}

}