//*************************************************************************
//			タイトル[CTitleScene.h]
//			Toshiki Kuwazoe
//			2017/8/20
//*************************************************************************

//*************************************************************************
//			二重定義防止
//*************************************************************************
#ifndef _CTITLESCENE_H_
#define _CTITLESCENE_H_
#pragma once

//*************************************************************************
//			ファイルインクルード
//*************************************************************************
#include "CScene.h"

//*************************************************************************
//			クラス宣言
//*************************************************************************
class CTitleScene : public CScene
{
public:
	// コンストラクタ
	CTitleScene(CSceneChanger *pSceneChanger);
	// デストラクタ
	~CTitleScene() {};
	// 初期化処理関数
	virtual HRESULT Init() { return S_OK; };
	// 終了処理関数
	virtual void Uninit() {};
	// 更新処理関数
	virtual void Update();
	// 描画処理関数
	virtual void Draw();


};


#endif // _CTITLESCENE_H_